export const CHARACTER_MAP = {
  0: '野蛮人',
  1: '法师',
  2: '守卫',
  3: '祭祀',
  4: '游侠',
};

export const MASTERY_MAP = {
  0: {
    1: '兽王',
    2: '萨满',
    3: '德鲁伊',
  },
  1: {
    1: '巫师',
    2: '法术之刃',
  },
  2: {
    1: '虚空骑士',
    2: '熔炉卫士',
    3: '圣骑士',
  },
  3: {
    1: '死灵法师',
    2: '巫妖',
  },
  4: {
    1: '刀刃舞者',
    2: '神射手',
  },
};

export enum BAG_TYPE {
  '背包' = 1,
  '头盔',
  '胸甲',
  '主武器',
  '副武器',
  '手套',
  '腰带',
  '鞋子',
  '右戒指',
  '左戒指',
  '护身符',
  '遗物',
  '神像栏' = 29,
}

export const BAG_WIDTH = 14;
export const BAG_HEIGHT = 8;
